ci4/app/Controllers/Artikel.php

    public function index()
    {
        $model = new ArtikelModel();
        $data = [
            'artikel' => $model->findAll()
        ];
---
SELECT *
FROM `artikel`